[
  {
    "spelling": "algorithm",
    "phonetic": "ˈælɡərɪðəm",
    "definition": "n. A step-by-step procedure for solving a problem or accomplishing a task, especially in computer science and mathematics.",
    "tags": "programming,computer-science"
  },
  {
    "spelling": "cognitive",
    "phonetic": "ˈkɒɡnɪtɪv",
    "definition": "adj. Relating to or involving the mental processes of perception, memory, judgment, and reasoning.",
    "tags": "psychology"
  },
  {
    "spelling": "eloquent",
    "phonetic": "ˈeləkwənt",
    "definition": "adj. Fluent or persuasive in speaking or writing; clearly expressing or indicating something.",
    "tags": "vocabulary,writing"
  },
  {
    "spelling": "paradigm",
    "phonetic": "ˈpærədaɪm",
    "definition": "n. A typical example or pattern of something; a model; a worldview underlying the theories and methodology of a particular scientific subject.",
    "tags": "academic,science"
  },
  {
    "spelling": "resilient",
    "phonetic": "rɪˈzɪliənt",
    "definition": "adj. Able to withstand or recover quickly from difficult conditions; flexible and able to spring back into shape.",
    "tags": "personality,general"
  },
  {
    "spelling": "sophisticated",
    "phonetic": "səˈfɪstɪkeɪtɪd",
    "definition": "adj. Having, revealing, or proceeding from a great deal of worldly experience and knowledge; complex and refined.",
    "tags": "vocabulary,advanced"
  },
  {
    "spelling": "threshold",
    "phonetic": "ˈθreʃhoʊld",
    "definition": "n. The magnitude or intensity that must be exceeded for a certain reaction, phenomenon, result, or condition to occur or be manifested; a point of entry or beginning.",
    "tags": "general,academic"
  },
  {
    "spelling": "ubiquitous",
    "phonetic": "juːˈbɪkwɪtəs",
    "definition": "adj. Present, appearing, or found everywhere; seeming to be everywhere at once.",
    "tags": "vocabulary,advanced"
  },
  {
    "spelling": "volatile",
    "phonetic": "ˈvɒlətaɪl",
    "definition": "adj. Liable to change rapidly and unpredictably, especially for the worse; (of a substance) easily evaporated at normal temperatures.",
    "tags": "science,general"
  },
  {
    "spelling": "zenith",
    "phonetic": "ˈziːnɪθ",
    "definition": "n. The time at which something is most powerful or successful; the highest point reached by a celestial or other object.",
    "tags": "vocabulary,astronomy"
  },
  {
    "spelling": "ambiguous",
    "phonetic": "æmˈbɪɡjuəs",
    "definition": "adj. Open to more than one interpretation; not having one obvious meaning; unclear or inexact because a choice between alternatives has not been made.",
    "tags": "vocabulary,writing"
  },
  {
    "spelling": "collaborate",
    "phonetic": "kəˈlæbəreɪt",
    "definition": "v. Work jointly on an activity or project; cooperate traitorously with an enemy.",
    "tags": "work,general"
  },
  {
    "spelling": "diligent",
    "phonetic": "ˈdɪlɪdʒənt",
    "definition": "adj. Having or showing care and conscientiousness in one's work or duties; characterized by steady, earnest, and energetic effort.",
    "tags": "personality,work"
  },
  {
    "spelling": "efficient",
    "phonetic": "ɪˈfɪʃənt",
    "definition": "adj. Achieving maximum productivity with minimum wasted effort or expense; working in a well-organized and competent way.",
    "tags": "work,general"
  },
  {
    "spelling": "fundamental",
    "phonetic": "ˌfʌndəˈmentl",
    "definition": "adj. Forming a necessary base or core; of central importance; n. A central or primary rule or principle on which something is based.",
    "tags": "academic,general"
  },
  {
    "spelling": "hypothesis",
    "phonetic": "haɪˈpɒθəsɪs",
    "definition": "n. A supposition or proposed explanation made on the basis of limited evidence as a starting point for further investigation.",
    "tags": "science,academic"
  },
  {
    "spelling": "implement",
    "phonetic": "ˈɪmplɪment",
    "definition": "v. Put (a decision, plan, agreement, etc.) into effect; n. A tool, utensil, or other piece of equipment used for a particular purpose.",
    "tags": "work,programming"
  },
  {
    "spelling": "justify",
    "phonetic": "ˈdʒʌstɪfaɪ",
    "definition": "v. Show or prove to be right or reasonable; be a good reason for; adjust (a line of type) to give even margins.",
    "tags": "writing,general"
  },
  {
    "spelling": "legitimate",
    "phonetic": "lɪˈdʒɪtɪmət",
    "definition": "adj. Conforming to the law or to rules; able to be defended with logic or justification; valid.",
    "tags": "legal,general"
  },
  {
    "spelling": "meticulous",
    "phonetic": "məˈtɪkjələs",
    "definition": "adj. Showing great attention to detail; very careful and precise; extremely thorough and careful about details.",
    "tags": "personality,work"
  }
]
